/**
 * Created by Administrator on 2016/1/15.
 */

//angular js
var zxClient=angular.module('zxClient',[]);
zxClient.controller('tabChange',function($scope){
    $scope.items = [
        {'name':'热点','cls':'active','selected':true,'topShow':true,'children':[{'tit':'深证及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'深证及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'深证及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'深证及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'深证及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'要闻','cls':'','selected':false,'topShow':true,'children':[{'tit':'自选及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'自选及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'自选及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'自选及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'自选及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'直播','cls':'','selected':false,'topShow':true,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'沪深','cls':'','selected':false,'topShow':false,'children':[{'tit':'金融及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'金融及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'金融及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'金融及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'金融及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'港股','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'权证','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'股指期货','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'基金','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'债券','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'机构','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'期货','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'经济','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'行业','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'市场','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'研究','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'新股','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'板块','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'宏观','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]},
        {'name':'简评','cls':'','selected':false,'topShow':false,'children':[{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'},{'tit':'招商及巨潮指数系列','cont':'晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览晚间必读：重要财经新闻与市场概况一览','date':'01-11 14:35'}]}


    ];

    $scope.select = function(item,items){
        for(var i=0;i<items.length;i++){
            items[i].selected = false;
            items[i].cls = "";
        }
        item.selected = true;
        item.cls = "active";
    }

    $scope.isShow=false;

    $scope.isAdd=function(item){
        for(var i=0;i<$scope.items.length;i++){
            //alert(item.name==$scope.items[i].name);
            if(item.topShow==true){
                //alert(item);
                 item.topShow=false;
                 //item.isSelected=false;
                //alert($scope.hasColumn)
            }
            else
            {
                item.topShow=true;
               // item.isSelected=true;
            } 
        }         
    }

    //正文detail
    $scope.isDetail=false;
    $scope.isDet=function(){
        $scope.isDetail=true;
    };

    $scope.isSer=false;
    $scope.data=
        {'tit':'亚投行正式起航 主要用美元结算','tips':{'source':'第一财经','date':'01-18 08:08'},'cont':'亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航'};
    $scope.isShare=false;

    $scope.isColl=function(){
        window.localStorage.setItem("details",JSON.stringify($scope.data));
    };

    $scope.isLarge=false;

})

// zxClient.controller('detail',function($scope){
//     $scope.isSer=false;
//     $scope.data=
//         {'tit':'亚投行正式起航 主要用美元结算','tips':{'source':'第一财经','date':'01-18 08:08'},'cont':'亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航亚投行正式起航'};
//     $scope.isShare=false;

//     $scope.isColl=function(){
//         window.localStorage.setItem("details",JSON.stringify($scope.data));
//     };

//     $scope.isLarge=false;
// })







